function HR2Ryu() {

  const React = require('react'); 
 const Typing = require ("./Typing.tsx");
  
  const words = [
    "政権交代",  "こども店長",  "事業仕分け",  "新型インフルエンザ",  "草食男子",  "脱官僚",  "派遣切り","ファストファッション",  "ぼやき",  "歴女",
    "ゲゲゲの～",  "いい質問ですねぇ",  "イクメン",  "AKB48",  "女子会",  "脱小沢", "食べるラー油", "ととのいました",  "～なう",  "無縁社会",  "何か持っていると言われ続けてきました。今日何を持っているかを確信しました…それは仲間です。" ,
    "なでしこジャパン",  "絆",  "スマホ",  "どじょう内閣",  "どや顔",  "帰宅難民",  "こだまでしょうか",  "3.11",  "風評被害","ラブ注入",
    "ワイルドだろぉ",  "ｉＰＳ細胞",  "維新",  "LCC",  "終活",  "第３極",  "近いうちに・・・",  "手ぶらで帰らせるわけにはいかない",  "東京ソラマチ",  "爆弾低気圧",
    "今でしょ！", "お・も・て・な・し", "じぇじぇじぇ","倍返し","アベノミクス","ご当地キャラ","特定秘密保護法","PM2.5",
    "ブラック企業","ヘイトスピーチ","被災地が、東北が、日本がひとつになった 楽天、日本一をありがとう", "ダメよ～ダメダメ","集団的自衛権",
    "ありのままで","カープ女子","壁ドン","危険ドラッグ","ごきげんよう","マタハラ","妖怪ウォッチ","レジェンド","爆買い","トリプルスリー",
    "アベ政治を許さない","安心して下さい、穿いてますよ。","一億総活躍社会","エンブレム","五郎丸ポーズ","SEALDs","ドローン","まいにち、修造！",
    "神ってる","聖地巡礼","トランプ現象","ゲス不倫","マイナス金利","盛り土","保育園落ちた日本死ね","ポケモンＧＯ","僕のアモーレ","PPAP","復興城主",
    "インスタ映え","忖度","35億","Jアラート","睡眠負債","ひふみん","フェイクニュース", "プレミアムフライデー","魔の2回生","9.98","29連勝",
    "そだねー","eスポーツ","(大迫)半端ないって","おっさんずラブ","ご飯論法","災害級の暑さ","愛の不時着","あつまれ どうぶつの森","アベノマスク",
    "アマビエ","鬼滅の刃","GoToキャンペーン","ソロキャンプ","フワちゃん","リアル二刀流","ショータイム", "うっせぇわ", "親ガチャ","ゴン攻め","ビッタビタ",
    "ジェンダー平等","人流","スギムライジング","Ｚ世代","ぼったくり男爵","黙食","村神様","キーウ","きつねダンス", "国葬儀", "宗教２世",
    "知らんけど","スマホショルダー","てまえどり","ヤクルト1000","悪い円安","青春って、すごく密なので"
  ]

  
  return (
    React.createElement(React.Fragment, null, React.createElement(Typing, { words: words }))
  );
}

module.exports = HR2Ryu;
