<<<<<<< HEAD

function HRRyu() {
const React = require('react');
const Typing = require("./Typing.tsx");

  const words = [
    "セクシャル・ハラスメント","Hanako","DODA","まじめ×ゆかい","濡れ落葉","オバタリアン/オバタリアン旋風","ケジメ","24時間タタカエマスカ","イカ天","こんなん出ましたけど～","「壁」開放","平成","ＮＯと言える日本",
    "ファジィ","“ブッシュ”ホン","オヤジギャル","アッシーくん","ちびまる子ちゃん","バブル経済","一番搾り","パスポートサイズ","愛される理由","昭和生まれの明治男","気象観測史上","スペシャルゲスト",
    "…じゃあ～りませんか","火砕流","ひとめぼれ","八月革命","川崎劇場","地球にやさしい","紺ブレ","若貴","重大な決意","損失補填","僕は死にましぇ～ん","ダダーン ボヨヨン ボヨヨン","ダンス甲子園","チャネリング","雅美さん 雅子さん 「たぬき顔」",
    "きんさん・ぎんさん","ほめ殺し",  "カード破産", "もつ鍋",  "複合不況","9K",  "謝長悔長","冬彦さん",  "ねェ、チューして","上申書","宇宙授業","歌手の小金沢クン", "ツインピークス", "Time for change",
    "Ｊリーグ","サポーター","フリーエージェント","規制緩和","清貧","天の声","親分","聞いてないよォ","お立ち台","2500円スーツ","ウゴウゴ・ルーガ","たま・ひよ（族）","悪妻は夫をのばす",
    "すったもんだがありました","イチロー","同情するならカネをくれ","価格破壊","ヤンママ", "新・新党","大往生","人にやさしい政治","契約スチュワーデス","関空","ゴーマニズム","就職氷河期",
    "無党派","NOMO","がんばろうＫＯＢＥ","ライフライン","安全神話","だ・よ・ね","ま、いっか","変わらなきゃ","官官接待","見た目で選んで何が悪いの!","インターネット",
    "自分で自分をほめたい","友愛/排除の論理","メークドラマ","援助交際","ルーズソックス","チョベリバ/チョベリグ","閉塞感(打開)","アムラー","がんもどき理論","不作為責任",
    "失楽園(する)",  "たまごっち",  "時のアセス", "ガーデニング",  "日本版ビッグ・バン",  "透明な存在",  "もののけ(姫)",  "パパラッチ",  "マイブーム",  "郵政３事業",
    "ハマの大魔神",  "凡人・軍人・変人",  "だっちゅーの",  "環境ホルモン",  "貸し渋り",  "老人力",  "ショムニ",  "モラル・ハザード",  "冷めたピザ","日本列島総不況",  "スマイリング・コミュニスト", "ボキャ貧",
    "雑草魂","ブッチホン",  "リベンジ","学校(級)崩壊","カリスマ","ミッチー・サッチー","西暦2000年問題", "だんご３兄弟","癒し", "ｉモード",
    "おっはー",  "ＩＴ革命",  "最高で金 最低でも金",  "Ｑちゃん",  "ジコチュー",  "一七歳",  "パラパラ",  "めっちゃ悔し～い",  "ワタシ(私)的には…",  "「官」対「民」",
    "米百俵",  "明日があるさ",  "ｅ‐ポリティックス",  "狂牛病",  "塩爺（しおじい）",  "ショー・ザ・フラッグ",  "生物兵器",  "抵抗勢力",  "ドメスティック・バイオレンス",  "ブロードバンド",  "ヤだねったら、ヤだね",  "人間て、なかなか死なないもんだ",  "ファンのみなさま、本当に日本一おめでとうございます！",
    "タマちゃん",  "中津江村",  "貸し剥がし",  "声に出して読みたい日本語",  "真珠夫人",  "ダブル受賞",  "内部告発",  "ベッカム様",  "ムネオハウス",  "拉致",  "ＧＯＤＺＩＬＬＡ",
    "毒まんじゅう",  "なんでだろう～",  "マニフェスト",  "勝ちたいんや!",  "コメ泥棒",  "SARS",  "年収300万円",  "バカの壁",  "ビフォー アフター",  "へぇ～",
     "チョー気持ちいい",  "気合だー!",  "サプライズ",  "自己責任",  "新規参入",  "セカチュー",  "中二階",  "って言うじゃない…/…残念!!/ ○○斬り!",  "負け犬",  "冬ソナ",  "私の人生の中では金メダル以上の経験",
      "小泉劇場",  "想定内(外)",  "クールビズ",  "刺客",  "ちょいモテオヤジ",  "フォーー!",  "富裕層",  "ブログ",  "ボビーマジック",  "萌え～",   
      "イナバウアー",  "品格",  "エロカッコイイ",  "格差社会",  "シンジラレナ～イ",  "たらこ・たらこ・たらこ",  "脳トレ",  "ハンカチ王子",  "ｍｉｘｉ",  "メタボリックシンドローム",
 '宮崎をどげんかせんといかん',  'ハニカミ王子',  '消えた年金',  'そんなの関係ねぇ',  'どんだけぇ～',  '鈍感力',  '食品偽装',  'ネットカフェ難民',  '大食い',  '猛暑日',
"アラフォー",  "グ～！",  "上野の４１３球",  "居酒屋タクシー",  "名ばかり管理職",  "埋蔵金",  "蟹工船",  "ゲリラ豪雨",  "後期高齢者",  "あなたとは違うんです",

   ]

  
  return (
    React.createElement(React.Fragment, null, React.createElement(Typing, { words: words }))
  );
}

module.exports = HRRyu;
=======

function HRRyu() {
const React = require('react');
const Typing = require("./Typing.tsx");

  const words = [
    "セクシャル・ハラスメント","Hanako","DODA","まじめ×ゆかい","濡れ落葉","オバタリアン/オバタリアン旋風","ケジメ","24時間タタカエマスカ","イカ天","こんなん出ましたけど～","「壁」開放","平成","ＮＯと言える日本",
    "ファジィ","“ブッシュ”ホン","オヤジギャル","アッシーくん","ちびまる子ちゃん","バブル経済","一番搾り","パスポートサイズ","愛される理由","昭和生まれの明治男","気象観測史上","スペシャルゲスト",
    "…じゃあ～りませんか","火砕流","ひとめぼれ","八月革命","川崎劇場","地球にやさしい","紺ブレ","若貴","重大な決意","損失補填","僕は死にましぇ～ん","ダダーン ボヨヨン ボヨヨン","ダンス甲子園","チャネリング","雅美さん 雅子さん 「たぬき顔」",
    "きんさん・ぎんさん","ほめ殺し",  "カード破産", "もつ鍋",  "複合不況","9K",  "謝長悔長","冬彦さん",  "ねェ、チューして","上申書","宇宙授業","歌手の小金沢クン", "ツインピークス", "Time for change",
    "Ｊリーグ","サポーター","フリーエージェント","規制緩和","清貧","天の声","親分","聞いてないよォ","お立ち台","2500円スーツ","ウゴウゴ・ルーガ","たま・ひよ（族）","悪妻は夫をのばす",
    "すったもんだがありました","イチロー","同情するならカネをくれ","価格破壊","ヤンママ", "新・新党","大往生","人にやさしい政治","契約スチュワーデス","関空","ゴーマニズム","就職氷河期",
    "無党派","NOMO","がんばろうＫＯＢＥ","ライフライン","安全神話","だ・よ・ね","ま、いっか","変わらなきゃ","官官接待","見た目で選んで何が悪いの!","インターネット",
    "自分で自分をほめたい","友愛/排除の論理","メークドラマ","援助交際","ルーズソックス","チョベリバ/チョベリグ","閉塞感(打開)","アムラー","がんもどき理論","不作為責任",
    "失楽園(する)",  "たまごっち",  "時のアセス", "ガーデニング",  "日本版ビッグ・バン",  "透明な存在",  "もののけ(姫)",  "パパラッチ",  "マイブーム",  "郵政３事業",
    "ハマの大魔神",  "凡人・軍人・変人",  "だっちゅーの",  "環境ホルモン",  "貸し渋り",  "老人力",  "ショムニ",  "モラル・ハザード",  "冷めたピザ","日本列島総不況",  "スマイリング・コミュニスト", "ボキャ貧",
    "雑草魂","ブッチホン",  "リベンジ","学校(級)崩壊","カリスマ","ミッチー・サッチー","西暦2000年問題", "だんご３兄弟","癒し", "ｉモード",
    "おっはー",  "ＩＴ革命",  "最高で金 最低でも金",  "Ｑちゃん",  "ジコチュー",  "一七歳",  "パラパラ",  "めっちゃ悔し～い",  "ワタシ(私)的には…",  "「官」対「民」",
    "米百俵",  "明日があるさ",  "ｅ‐ポリティックス",  "狂牛病",  "塩爺（しおじい）",  "ショー・ザ・フラッグ",  "生物兵器",  "抵抗勢力",  "ドメスティック・バイオレンス",  "ブロードバンド",  "ヤだねったら、ヤだね",  "人間て、なかなか死なないもんだ",  "ファンのみなさま、本当に日本一おめでとうございます！",
    "タマちゃん",  "中津江村",  "貸し剥がし",  "声に出して読みたい日本語",  "真珠夫人",  "ダブル受賞",  "内部告発",  "ベッカム様",  "ムネオハウス",  "拉致",  "ＧＯＤＺＩＬＬＡ",
    "毒まんじゅう",  "なんでだろう～",  "マニフェスト",  "勝ちたいんや!",  "コメ泥棒",  "SARS",  "年収300万円",  "バカの壁",  "ビフォー アフター",  "へぇ～",
     "チョー気持ちいい",  "気合だー!",  "サプライズ",  "自己責任",  "新規参入",  "セカチュー",  "中二階",  "って言うじゃない…/…残念!!/ ○○斬り!",  "負け犬",  "冬ソナ",  "私の人生の中では金メダル以上の経験",
      "小泉劇場",  "想定内(外)",  "クールビズ",  "刺客",  "ちょいモテオヤジ",  "フォーー!",  "富裕層",  "ブログ",  "ボビーマジック",  "萌え～",   
      "イナバウアー",  "品格",  "エロカッコイイ",  "格差社会",  "シンジラレナ～イ",  "たらこ・たらこ・たらこ",  "脳トレ",  "ハンカチ王子",  "ｍｉｘｉ",  "メタボリックシンドローム",
 '宮崎をどげんかせんといかん',  'ハニカミ王子',  '消えた年金',  'そんなの関係ねぇ',  'どんだけぇ～',  '鈍感力',  '食品偽装',  'ネットカフェ難民',  '大食い',  '猛暑日',
"アラフォー",  "グ～！",  "上野の４１３球",  "居酒屋タクシー",  "名ばかり管理職",  "埋蔵金",  "蟹工船",  "ゲリラ豪雨",  "後期高齢者",  "あなたとは違うんです",

   ]

  
  return (
    React.createElement(React.Fragment, null, React.createElement(Typing, { words: words }))
  );
}

module.exports = HRRyu;
>>>>>>> 1adeb664440dce7d4f5784b3ba079c5ab77868da
